import React, { useMemo } from "react";
import TrustCard from "./TrustCard";

const MakeTrust = () => {
  const data = useMemo(
    () => [
      {
        id: 1,
        title: "چرا ما را انتخاب کنید؟",
        description: `با طراحی‌های ارگونومیک، راحتی و سلامت ستون فقرات شما تضمین می‌شود
تنوع مدل‌ها و رنگ‌بندی‌ها، دست شما را برای انتخاب کاملاً باز می‌گذارد
تمام محصولات از متریال باکیفیت و بادوام ساخته شده‌اند تا سال‌ها همراه‌تان باشند
پشتیبانی تخصصی و ارسال سریع به سراسر کشور، تجربه‌ای مطمئن برای شما فراهم می‌کند`,
        icon: "/chair.png",
      },
      {
        id: 2,
        title: "فضای کاری‌ات رو حرفه‌ای بچین!",
        description: `یک فضای کاری خوب فقط یک محیط ساده نیست؛ جاییه که الهام‌بخش، منظم و در عین حال راحت باشه
با انتخاب میز و صندلی‌های ارگونومیک و مدرن ما، نه‌تنها به سلامت و بهره‌وری خودت کمک می‌کنی، بلکه زیبایی و نظم رو به محل کارت میاری
اگه دنبال یه تغییر جدی تو حال و هوای دفترت هستی، همین حالا نگاهی به محصولات ما بنداز و قدم اول رو برای ساختن یه محیط کاری حرفه‌ای بردار`,
        icon: "/brainstorm.png",
      },
      {
        id: 3,
        title: "محیط کارت رو متحول کن!",
        description: `فضای کاری تأثیر مستقیمی روی تمرکز، انگیزه و بازدهی داره. با محصولات ما، می‌تونی محیطی بسازی که هم از نظر زیبایی چشم‌نواز باشه، هم از نظر ارگونومی، راحت و استاندارد.
چه برای دفتر شرکت، چه برای فضای کاری خونگی، مجموعه‌ی ما طراحی شده تا به نیازهای حرفه‌ای تو پاسخ بده.
حالا وقتشه فضای کارت رو حرفه‌ای‌تر و کارآمدتر از همیشه بچینی — از همین‌جا شروع کن!`,
        icon: "/alarm.png",
      },
      {
        id: 4,
        title: "وقتشه به کارت احترام بذاری!",
        description: `ساعت‌های زیادی از روزتو پشت میز کار می‌گذرونی؛ پس چرا توی یه محیط خسته‌کننده باشی؟
با میز و صندلی‌های استاندارد و خوش‌طراحی ما، می‌تونی یه فضای کاری بسازی که هم راحت باشه، هم با کلاس
از طراحی مدرن تا راحتی واقعی، همه‌چی آماده‌ست تا یه تغییر جدی رو شروع کنی`,
        icon: "/employee.png",
      },
    ],
    []
  );

  return (
    <div className="container mx-auto my-10 flex flex-col items-center gap-5">
      <h2 className="scroll-m-20 border-b pb-2 text-3xl font-semibold tracking-tight first:mt-0 text-center">
        فراچوب
      </h2>
      {/* <h3 className="scroll-m-20 text-center text-xl font-normal tracking-tight text-balance text-neutral-600">
        با بهترین متریال
      </h3> */}

      {data.map((item) => {
        return <TrustCard key={item.id} item={item} length={data.length} />;
      })}
    </div>
  );
};

export default MakeTrust;
